{
  "projects": [
    {
      "name": "Modeling the Functional Architecture of the Visual System",
      "description": "The visual system is full of rich and interesting phenomena, many of which are poorly understood. We are using deep convolutional neural networks to model the development of the ventral visual system, which is thought to be responsible for recognizing objects. Large-scale models of the development of this system will enable us to understand how an animal's experience may affect the structure and development of its visual system.",
      "img_src": "img/spacenet.png",
      "url": "img/Margalit_et_al_VSS_2018.png",
      "url_text": "VSS Poster",
      "alt": "Orientation tuning map from a computational model of primary visual cortex",
      "id": "func-arch"
    },
    {
      "name": "Characterizing the Fine Scale Functional Architecture of the Ventral Temporal Cortex",
      "description": "Recent advances in fMRI technology have allowed insights into the functional organization of cortical regions at unprecented resolution. In collaboration with the CVN Lab at the University of Minnesota, we are examining areas of the brain that preferentially respond to different object categories and studying their arrangement in the cortical sheet.",
      "img_src": "img/vtc_faces.png",
      "url": "https://www.abstractsonline.com/pp8/#!/4649/presentation/41470",
      "url_text": "SfN 2018 Abstract",
      "alt": "Category tuning maps from ultra-high-res human fMRI",
      "id": "hires"
    },
    {
      "name": "Interactive Web Application for Gabor-jet Model",
      "description": "The Gabor-jet model is a tool used to compute the psychophysical dissimilarity between images: an objective metric of how dissimilar two images appear. The model predicts over 90% of the variance in human responses on a match-to-sample task with artificial face stimuli, making it an invaluable tool in psychophysical research. I designed a webpage to act as an interactive guided tour of the model, allowing users to upload and test their own stimuli in-browser. Try it yourself!",
      "img_src": "img/gabor_grab.PNG",
      "url": "http://geon.usc.edu/GJW",
      "url_text": "Online Gabor Filtering App",
      "alt": "Screenshot from online Gabor filtering app",
      "id": "web-app"
    },
    {
      "name": "Object Familiarity in LOC",
      "description": "Hundreds of studies have explored the Lateral Occipital Complex (LOC), which is critical for shape perception. Early studies discounted a role of familiarity by showing that “abstract” sculptures, unfamiliar to the subjects, also activated this region. This characterization of LOC as a region that responds to shape independently of familiarity had been accepted but never tested with control of the same low-level features. We assessed LOC’s response to objects that had identical parts in two different arrangements, one familiar and the other novel. The early work was correct: there is no net effect of familiarity in LOC, although multivariate classifiers suggest that LOC does distinguish familiar from novel objects.",
      "img_src": "img/LOC_mricrogl.png",
      "url": "http://jov.arvojournals.org/article.aspx?articleid=2551659",
      "url_text": "Article in Journal of Vision",
      "alt": "Brain representation showing regions activated more by unfamiliar than familiar images",
      "id": "loc-fam"
    },
    {
      "name": "Developmental Prosopagnosia",
      "description": "Developmental prosopagnosics (DPs) present no lesions nor have a history of compromised neural functioning. Given that their activation of face-selective cortex is normal, it surprised us that their capacity to perceptually discriminate faces and non-face objects had never been rigorously assessed. Normal discrimination of faces would suggest that the underlying deficit might not be a consequence of a poor perceptual representation but, instead, difficulty in matching a well-defined representation to stored representations in memory. If a deficit in discriminating faces is observed, is it also manifested when discriminating non-face stimuli that differ along the same underlying physical attributes as faces and to an equivalent extent as the faces? We found that, indeed, DPs present deficits in discriminating both faces and tooth-like blobs, but that this deficit does not extend to simple geometric primitives.",
      "img_src": "img/dissim_histogram.png",
      "url": "http://geon.usc.edu/~biederman/presentations/Margalit_et_al_VSS_16.pdf",
      "url_text": "VSS Poster",
      "alt": "Histogram of image dissimilarity for two image classes used to explore face processing",
      "id": "dp-hist"
    }
  ]
}
